Tekla Open API Reference for Tekla Structures 2025
ModelObjectEnumerator Methods
The ModelObjectEnumerator type exposes the following members.
Methods
Name | Description
GetEnumerator
 Gets the enumerator.
GetSize
 Returns the total amount of items.
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
See Also
Reference
ModelObjectEnumerator Class
Tekla.Structures.Model Namespace